{
  "workExperience": [
    {
      "title": "Software Engineer - Freelance",
      "company": "Undertone",
      "location": "",
      "date": "5/2020 - Present",
      "responsibilities": []
    },
    {
      "title": "Software Engineer",
      "company": "Undertone",
      "location": "New York, NY",
      "date": "5/2019 - 1/2020",
      "responsibilities": [
        "Developed features and fixes for multiple React, Redux and Node based platforms.",
        "Increased data reliability and error response time by building cron job monitors in Node to detect issues with external APIs and Redis sync processes.",
        "Created SQL scripts to perform manual backend updates by user request.",
        "Authored and maintained detailed REST API and application dataflow documentation for internal and user reference.",
        "Monitored log activity and cached data in AWS, Kubernetes, and Kibana dashboards to quickly debug issues."
      ]
    },
    {
      "title": "Technical Support Specialist",
      "company": "Conxeo",
      "location": "Tarrytown, NY",
      "date": "2/2017 - 11/2018",
      "responsibilities": [
        "Developed Zendesk triggers to send automated replies generated by ticket content.",
        "Created custom solution templates for clients based on support ticket history."
      ]
    },
    {
      "title": "Customer Technical Support Specialist",
      "company": "Turtle Beach Corp",
      "location": "Valhalla, NY",
      "date": "11/2011 - 2/2017",
      "responsibilities": [
        "Proposed, built and launched a new Turtle Beach Support Website in jQuery, HTML and CSS, which resulted in a 30% decrease of incoming support tickets.",
        "Created custom solution templates for clients based on support ticket history.",
        "Created over 200 support articles, FAQs, and troubleshooting diagrams for the Turtle Beach Support Website.",
        "Improved SEO and web rankings for the support website by monitoring search and visitor analytics."
      ]
    }
  ],
  "education": [
    {
      "title": "Full Stack Engineering Immersive - Grace Hopper Program",
      "school": "Fullstack Academy",
      "location": "New York, NY",
      "date": "1/2018 - 4/2018",
      "curriculum": [
        "Developed full-stack applications using Javascript, React, Redux, Node, Postgres, React Native, and Viromedia AR."
      ]
    },
    {
      "title": "Computer Science Curriculum",
      "school": "SUNY WCC",
      "location": "Valhalla, NY",
      "date": "Attd. 1/2014 - 5/2017",
      "curriculum": [
        "Courses: Computer Programming (C++), Web Programming, GUI Development, Java Development, Linux Operating Systems, Data Structures"
      ]
    }
  ]
}
