{
  "workExperience": [
    {
      "title": "Software Engineer",
      "company": "Undertone",
      "location": "New York, NY",
      "date": "5/2019 - 1/2020, 5/2020 - Present",
      "responsibilities": [
        "Develop features for Node, React and Ruby full stack applications and cron jobs in Agile sprints.",
        "Created a Docker development environment for engineers that incorporates production-level networking and dependency management, tools such as Verdaccio for NPM package testing, and Docker-Sync for faster development on Mac OS.",
        "Engineered an auto-update alert system for client partners to reduce manual campaign maintenance with integral business implications.",
        "Coordinate feature requirements and user stories with other departments.",
        "Generate SQL scripts for custom reporting and bulk backend updates."
      ]
    },
    {
      "title": "Technical Support Specialist",
      "company": "Conxeo",
      "location": "Tarrytown, NY",
      "date": "2/2017 - 11/2018",
      "responsibilities": [
        "Developed Zendesk triggers to send automated replies generated by ticket content.",
        "Created custom solution templates for clients based on support ticket history."
      ]
    },
    {
      "title": "Customer Technical Support Specialist",
      "company": "Turtle Beach Corp",
      "location": "Valhalla, NY",
      "date": "11/2011 - 2/2017",
      "responsibilities": [
        "Proposed, built and launched a new Turtle Beach Support Website in jQuery, HTML and CSS, which resulted in a 30% decrease of incoming support tickets.",
        "Created custom solution templates for clients based on support ticket history.",
        "Created over 200 support articles, FAQs, and troubleshooting diagrams for the Turtle Beach Support Website.",
        "Improved SEO and web rankings for the support website by monitoring search and visitor analytics."
      ]
    }
  ],
  "education": [
    {
      "title": "Full Stack Engineering Immersive - Grace Hopper Program",
      "school": "Fullstack Academy",
      "location": "New York, NY",
      "date": "1/2018 - 4/2018",
      "curriculum": [
        "Developed full-stack applications using Javascript, React, Redux, Node, Postgres, React Native, and Viromedia AR."
      ]
    },
    {
      "title": "Computer Science Curriculum",
      "school": "SUNY WCC",
      "location": "Valhalla, NY",
      "date": "Attd. 1/2014 - 5/2017",
      "curriculum": [
        "Courses: Computer Programming (C++), Web Programming, GUI Development, Java Development, Linux Operating Systems, Data Structures"
      ]
    }
  ]
}
